
## Plan Result

[CI link](https://github.com/morisoba00/aws-ecs-terraform/actions/runs/5098438891)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * aws_route53_record.record
  * aws_route53_zone.d-wiki_zone
* Update
  * aws_ecs_service.ecs_service


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:972365086582:service/go-simple-server/go-simple-server"
        name                               = "go-simple-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:972365086582:task-definition/go-simple-server:3" -> "arn:aws:ecs:ap-northeast-1:972365086582:task-definition/go-simple-server:1"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_route53_record.record will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "d-wiki.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = "go-simple-server-alb-88156255.ap-northeast-1.elb.amazonaws.com"
          + zone_id                = "Z14GRHDCWA56QT"
        }
    }

  # aws_route53_zone.d-wiki_zone will be created
  + resource "aws_route53_zone" "d-wiki_zone" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "d-wiki.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":16,"Program":"tfcmt","SHA1":"dc1e41f118b09ec5f64c79b522e6b7634a2fa3c8","Vars":{},"WorkflowName":"Terraform"} -->